let arr = [];

arr[0] =  [        
    ["за дзедам шведам","следам за дзедам","як швед пад Палтавай","за царом гарохам"],
    ["вельмі даўно","нядаўна","блізка","далека"],
    ["за дзедам шведам"],
    ["вельмі даўно"],
    [0]
];

arr[1] = [
    ["як кот наплакаў","як кошка з сабакам","якая кошка прабегла","кошкі душу скрабуць"],
    ["вельмі мала","вельмі малы","сумна","далека"],
    ["як кот наплакаў"],
    ["вельмі мала"],
    [1]
];

arr[2] = [
    ["як баран на новыя вароты","як (што) баран у Бібліі","гнуць у бараноў рог","на барана"],
    ["нічога не разумеючы","шчыра ўзірацца","не бачыць","злосна"],
    ["як баран на новыя вароты"],
    ["нічога не разумеючы"],
    [2]
];

arr[3] =  [
    ["што (як,нібы) з гусі вада","ганяць гусей","як гусіны пуп","вада не трымаецца"],
    ["абсалютна аднолькава, без розніцы","суха","мокра","вельмі добра"],
    ["што (як,нібы) з гусі вада"],
    ["абсалютна аднолькава, без розніцы"],
    [3]
];

arr[4] = [
    ["вераб’ю па калена","з вераб’ёў нос","страляць з гарматы па вераб’ях","вераб’іны харч"],
    ["вельмі мала","мокра","шмат","многа"],
    ["вераб’ю па калена"],
    ["вельмі мала"],
    [4]
];

arr[5] = [
    ["кот у мяшку","кот не валяўся","чорны кот прабег","як з мяшка"],
    ["невядомае, няпэўнае","малое","прыгожае","многа"],
    ["кот у мяшку"],
    ["невядомае, няпэўнае"],
    [5]
];

arr[6] = [
    ["як гром з яснага неба","гром грымнуў","неба з аўчынку здаецца","валіцца з неба"],
    ["нечакана,раптоўна","гучна","ярка","няшчасце"],
    ["як гром з яснага неба"],
    ["нечакана,раптоўна"],
    [6]
];

arr[7] =  [
    ["не святыя гаршкі лепяць","святая святых","на святое ніколі","як у гаршку"],
    ["кожнаму пад сілу","не кожны можа зрабіць","лёгка","святая праца"],
    ["не святыя гаршкі лепяць"],
    ["кожнаму пад сілу"],
    [7]
];

arr[8] = [
    ["рукой падаць","адной рукой","махнуць рукой","пад рукой"],
    ["зусім блізка","родны","далёка","мала"],
    ["рукой падаць"],
    ["зусім блізка"],
    [8]
];

arr[9] = [
    ["асінае гняздо","вылятаць з гнязда","віць гняздо","вось дык штука"],
    ["зборышча небяспечных, шкодных людзей","гіблае месца","небяспека","цёплае месца"],
    ["асінае гняздо"],
    ["зборышча небяспечных, шкодных людзей"],
    [9]
];

arr[10] = [
    ["воўк у авечай скуры","марскі воўк","стары воўк","блудная авечка"],
    ["крывадушны чалавек"," вопытны чалавек","скардзіцца на пакуты","далека"],
    ["воўк у авечай скуры"],
    ["крывадушны чалавек"],
    [10]
];

arr[11] = [
    ["аж пяткі блішчаць","з галавы да пят","душа ў пяткі","па пятах"],
    ["вельмі хутка ўцякаць","не адстаючы","чыста вымыцца","спалохацца чаго-небудзь"],
    ["аж пяткі блішчаць"],
    ["вельмі хутка ўцякаць"],
    [11]
];

arr[12] = [
    ["блудзіць у трох сонах","блукаць па пакутах","блудная авечка","з бору па сасонцы"],
    ["не разбірацца ў самым простым","цяжкія жыццёвыя выпрабаванні","разабрацца ў самым простым","далека"],
    ["блудзіць у трох сонах"],
    ["не разбірацца ў самым простым"],
    [12]
];

arr[13] = [
    ["як снег на галаву","леташні снег","снегу леташняга не дапросішся","на галаву вышэй"],
    ["раптоўна","нічога не варта","хутка","зімна"],
    ["як снег на галаву"],
    ["раптоўна"],
    [13]
];

arr[14] =  [
    ["як дзве кроплі вады","ні кроплі","як у кроплі вады","да апошняй кроплі"],
    ["падобны","розныя","малыя","чыстыя"],
    ["як дзве кроплі вады"],
    ["падобны"],
    [14]
];

arr[15] = [
    ["як сабаку пятая нага","адна нага тут другая там","каб і нагі не было","нага за нагу"],
    ["не патрэбны","патрэбны","вельмі хутка","вельмі марудна"],
    ["як сабаку пятая нага"],
    ["не патрэбны"],
    [15]
];

arr[16] = [
    ["вісець на тэлефоне","вісець на шыі","вісець паміж небам і зямлёй","абрываць тэлефон"],
    ["доўга гаварыць","хутка ісці","мала гаварыць","дакучаць каму-небудзь"],
    ["вісець на тэлефоне"],
    ["доўга гаварыць"],
    [16]
];

arr[17] = [
    ["ранняя птушка","сіняя птушка","птушку па палёце","з вышыні птушынага палёту"],
    ["чалавек, які рана ўстае","чалавек, які рана лажыцца","сімвал шчасця","вельмі вопытны чалавек"],
    ["ранняя птушка"],
    ["чалавек, які рана ўстае"],
    [17]
];

arr[18] = [
    ["белая варона","варона загуменная","пужаная варона","варона ў паўлінавых пёрах"],
    ["не такі, як усе","залішне асцярожны чалавек","разявяка","гультай"],
    ["белая варона"],
    ["не такі, як усе"],
    [18]
];

arr[19] = [
    ["конь не валяўся","траянскі конь","конь божы","па конях!"],
    ["нічога не зроблена","хітры падман","наперад","неразумны чалавек"],
    ["конь не валяўся"],
    ["нічога не зроблена"],
    [19]
];

arr[20] =  [
    ["працерці вочы","працерці з пясочкам","вочы павылазілі","вочы на мокрым месцы"],
    ["прачынацца","спаць","заснуць","не звяртаць увагі"],
    ["працерці вочы"],
    ["прачынацца"],
    [20]
];

arr[21] = [
    ["пад абцасам","абуць сэрца ў лапці","абціраць вуглы","абысці бокам"],
    ["у поўным падпарадкаванні","вельмі строга","сурова","малы"],
    ["пад абцасам"],
    ["у поўным падпарадкаванні"],
    [21]
];

arr[22] = [
    ["старая песня","песня песень","лебядзіная песня","песня спета"],
    ["даўно вядомае","незразумелы тэкст","найлепшы твор","далека"],
    ["старая песня"],
    ["даўно вядомае"],
    [22]
];

arr[23] =  [
    ["хадзіць на задніх лапках","хадзіць па струнцы","хадзіць па лязе","хадзіць па нітачцы"],
    ["падхалімнічаць","старацца быць вышэй ростам","мімаходам","калыхацца"],
    ["хадзіць на задніх лапках"],
    ["падхалімнічаць"],
    [23]
];

arr[24] = [
    ["ахілесава пята","душа ў пятках","з галавы да пят","лізаць пяткі"],
    ["слабае месца","святое месца","неадступна ісці за кімсьці","моцнае месца"],
    ["ахілесава пята"],
    ["слабае месца"],
    [24]
];

arr[25] = [
    ["арыядніна ніць","пуцяводная ніць","выцягваца ў нітку","сухой ніткі няма"],
    ["сродак выйсці з цяжкага становішча","вызначальны пачатак","сродак заблытаць чалавека","моц чалавека"],
    ["арыядніна ніць"],
    ["сродак выйсці з цяжкага становішча"],
    [25]
];

arr[26] = [
    ["аўгіевы стайні","стаіць дыханне","як свет стаіць","конь не валяўся"],
    ["забруджанае месца","вельмі чыстае месца","самае прыгожае месца","мала месца"],
    ["аўгіевы стайні"],
    ["забруджанае месца"],
    [26]
];

export default arr;