let Test1_arr = [];

Test1_arr[0] = [
    "Адзначце словы (спалучэнні слоў), вымаўленне якіх не супадае з напісаннем:",
    [
        "павялічваць",
        "дождж",
        "дуб і бяроза",
        "вузкі",
        "параўнаць"
    ],
    "234"
];
Test1_arr[1] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара э:",
    [
        "др...зіна",
        "ш...равокі",
        "ж...рдзе",
        "...тымалогія",
        "ц...рымонія"
    ],
    "234"
];
Test1_arr[2] = [
    "Адзначце словы з трэцім націскным складам:",
    [
        "металургія",
        "кулінарыя",
        "камбала",
        "гліняны",
        "ліставы"
    ],
    "125"
];
Test1_arr[3] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара е:",
    [
        "выдз...ліць",
        "кал...іна",
        "сн...гіры",
        "м...ханіка",
        "ата...самліваць"
    ],
    "134"
];
Test1_arr[4] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара і:",
    [
        "за...мальна",
        "пра...снаваць",
        "пра...маць",
        "ад...мжэць",
        "за...кацца"
    ],
    "25"
];
Test1_arr[5] = [
    "Адзначце прыклады, у якіх на месцы пропуску пішацца літара у (складовае):",
    [
        "дома, ...сваёй вёсцы",
        "архівары...с",
        "байска...т",
        "беларуска-...краінскі",
        "рады...с"
    ],
    "125"
];
Test1_arr[6] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца мяккі знак:",
    [
        "сур...ёзны",
        "кустоў...е",
        "грыл...яж",
        "п...яўка",
        "міл...ён"
    ],
    "35"
];
Test1_arr[7] = [
    "Адзначце словы, у якіх прапушчана літара:",
    [
        "ап...аратура",
        "надзейнасц...ю",
        "нязмен...ы",
        "печ...у",
        "маз...ю"
    ],
    "345"
];
Test1_arr[8] = [
    "Адзначце словы, у якіх напісанне выдзеленых арфаграм заснавана на марфалагічным прынцыпе:",
    [
        "УСпрыняць",
        "аблаСНы",
        "АДЧыніць",
        "нЯясны",
        "выпаДкова"
    ],
    "35"
];
Test1_arr[9] = [
    `Устанавіце адпаведнасць паміж выдзеленымі парамі слоў і іх сэнсавай характарыстыкай. Адзначце нумар правільнага адказу:  
        А Работа сэрца – друкаваная работа               1. Амонімы 
        Б Жылое асяроддзе – абжыты асяродак              2. Мнагазначныя словы
        В Актыўная пазіцыя – пасіўная канструкцыя        3. Паронімы
        Г Беспадстаўны вывад – беспрычынны смех          4. Сінонімы
                                                         5. Антонімы`,
        [
            "А1Б3В2Г4",
            "А2Б3В5Г4",
            "А3Б4В2Г1",
            "А2Б4В1Г5",
            "А4Б2В1Г5"
        ],
        "2"    
];
Test1_arr[10] = [
    "Адзначце словы, якія пішуцца разам:",
    [
        "(паў)апельсіна",
        "(празрыста)белы",
        "(дома)уладанне",
        "Дунін(Марцінкевіч)",
        "(контр)праект"
    ],
    "135"
];
Test1_arr[11] = [
    "Знайдзіце і адзначце прыслоўі ў форме вышэйшай ступені параўнання:",
    [
        "найбольш поўна",
        "гучнейшы",
        "больш слаўна",
        "магутней",
        "найдаступней"
    ],
    "34"
];
Test1_arr[12] = [
    "Адзначце сінтаксічныя канструкцыі, якія не з’яўляюцца словазлучэннямі:",
    [
        "яблыні і вішні",
        "дзвесце другі",
        "вясна прыгожая",
        "каманда карабля",
        "вузкая дарога"
    ],
    "123"
];
Test1_arr[13] = [
    "Адзначце словы, вымаўленне якіх не супадае з напісаннем:",
    [
        "перад Іванам",
        "грыб",
        "легкі",
        "прайграць",
        "сонца"
    ],
    "123"
];
Test1_arr[14] = [
    "Адзначце сказы, у якіх выдзеленае слова (словы) з’яўляецца азначэннем:",
    [
        "Вочы БЛАКІТНЫЯ, ЧЫСТЫЯ.",
        "Дукрэй перадаў па ланцужку каманду СПЫНІЦЦА.",
        "Маці яшчэ доўга ўспамінала аб МІНУЛЫМ.",
        "Вёска НАША злілася з горадам.",
        ""
    ],
    "24"
];
Test1_arr[15] = [
    "Адзначце сказы, у якіх выдзеленае слова з’яўляецца дапаўненнем:",
    [
        "МАЦІ ўжо даўно ўстала.",
        "Далёка разліваецца Нёман УВЕСНУ.",
        "Князь рэзка павярнуў СІВАГА і наўскач паляцеў па лугавіне.",
        "Вёска наша злілася з горадам, і можна лічыць ЯЕ гарадскою вуліцай.",
        ""
    ],
    "34"
];
Test1_arr[16] = [
    "Адзначце сказы, у якіх на месцы пропускаў абавязкова ставіцца працяжнік:",
    [
        "Даволі рэдкая ў Беларусі птушка_шчур.",
        "Вясна_пара надзей і спадзяванняў",
        "Лясная цішыня_падманлівая.",
        "Асноўны клопат пісьменніка_знайсці водгук у сэрцы чытача.",
        ""
    ],
    "24"
];
Test1_arr[17] = [
    "Адзначце сказы з прапушчанымі знакамі прыпынку:",
    [
        "Нашы прашчуры прыдумалі сакавіку шмат назваў зімабор, светазар, кропельнік, веснавей, пазімнік.",
        "Любоў да роднага краю і натхняла і акрыляла, і падымала над крыўдамі і нягодамі.",
        "Пойдзем рэха шукаць, град арэхаў збіраць, дні юнацтва гукаць.",
        "Людзі сена сушаць, косяць ды пагоды ў неба просяць",
        ""
    ],
    "12"
];
Test1_arr[18] = [
    "Адзначе сказы, у якіх на месцы пропуску трэба паставіць двукроп’е:",
    [
        "На нягоды жыцця не жальцеся_не было б перамог без нягод.",
        "Лета збірае_зіма паядае.",
        "Азірніся і ўбачыш_ля цябе я ў любую хвіліну.",
        "Сейбіт меў асалоду_жыта слаўна ўрадзіла.",
        ""
    ],
    "134"
];
Test1_arr[19] = [
    `Выпішыце граматычную аснову безасабовага сказа:
        У душу чалавека не зазірнеш.
        Белы домік на ўзлеску.
        Па роснай мураве шпарка крочым да ракі.
        З балот пацягнула вільгаццю.`,
    [
        "зазірнеш",
        "домік",
        "крочым",
        "пацягнула",
        ""    
    ],
    "4"   
];

export default Test1_arr.sort(() => Math.random() - 0.5);
