let Test2_arr = [];

Test2_arr[0] = [
    "Адзначце словы (спалучэнні слоў), вымаўленне якіх не супадае з напісаннем:",
    [
        "барацьба",
        "перадрукоўваць",
        "лодка",
        "прыдарожны",
        "дзядзька"
    ],
    "135"
];
Test2_arr[1] = [
    "Адзначце словы з першым націскным складам:",
    [
        "камбала",
        "цяжар",
        "сівы",
        "спіна",
        "генезіс"
    ],
    "145"
];
Test2_arr[2] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца о:",
    [
        " ж...ўталісты",
        "сыр...ватка",
        "р...знатраўе",
        "ч...рнабароды",
        "галант...рэя"
    ],
    "24"
];
Test2_arr[3] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара е:",
    [
        "св...ткаванне",
        "вым...цены",
        "аб...ліск",
        "верац...но",
        "с...мнаццаць"
    ],
    "23"
];
Test2_arr[4] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара й:",
    [
        "вы...грыш",
        "за...сці",
        "пады...граць",
        "пра...нфармаваць",
        "дэз...нфармацыя"
    ],
    "12"
];
Test2_arr[5] = [
    "Адзначце прыклады, у якіх на месцы пропуску пішацца літара ў(нескладовае):",
    [
        "позняй восенню, .. лістападзе",
        "да ...ніверсітэта",
        "за ...становай",
        "нака...т",
        "фа...на"
    ],
    "2345"
];
Test2_arr[6] = [
    "Адзначце словы, у якіх на месцы пропуску пішацца літара ь:",
    [
        "кін...це",
        "рамен...чык",
        "іл...няны",
        "б...е",
        "кон...скі"
    ],
    "123"
];
Test2_arr[7] = [
    "Адзначце словы, у якіх пішацца апостраф:",
    [
        "здароў...е",
        "л...е",
        "з...езд",
        "Іл...я",
        "шчаў...е"
    ],
    "3"
];
Test2_arr[8] = [
    "Адзначце словы, у якіх прапушчана літара:",
    [
        "ад...алены",
        "груп...а",
        "веліч...у",
        "мас...аж",
        "ван...а"
    ],
    "135"
];
Test2_arr[9] = [
    `Устанавіце адпаведнасць паміж выдзеленымі парамі слоў і іх сэнсавай характарыстыкай. Адзначце нумар правільнага адказу:    
    А. Надраць бульбы – надраць паперы.                1. Амонімы 
    Б. Маўклівая згода – гаваркая жанчына               2. Мнагазначныя словы
    В. Засвяціла плёнку – засвяціла сонца        3. Паронімы
    Г. Недахопаў не было – многа хібаў          4. Сінонімы
                                                         5. Антонімы`,
        [
            "А2Б4В5Г3",
            "А2Б5В1Г4",
            "А1Б3В2Г5",
            "А1Б2В5Г4",
            "А1Б5В2Г4"
        ],
        "2"    
];
Test2_arr[10] = [
    "Адзначце словы, у якіх напісанне выдзеленых арфаграм заснавана на фанетычным прынцыпе:",
    [
        "на клаДЦы",
        "БЕСкампрамісны",
        "АлЯксандр",
        "каЗка",
        "чэСНы"
    ],
    "235"
];
Test2_arr[11] = [
    "Знайдзіце і адзначце прыслоўі ў форме вышэйшай ступені параўнання:",
    [
        "найбольш поўна",
        "бліжэй",
        "больш важна",
        "найменш",
        "прыгажэйшы"
    ],
    "23"
];
Test2_arr[12] = [
    "Адзначце словы, якія пішуцца разам:",
    [
        "(паў) Беларусі",
        "навукова (даследчы)",
        "(кіна) фестываль",
        "(прэс) сакратар",
        "(экс) чэмпіён"
    ],
    "3"
];
Test2_arr[13] = [
    "Адзначце сінтаксічныя канструкцыі, якія не з’яўляюцца словазлучэннямі:",
    [
        "расцвілі пралескі",
        "местачковы жыхар",
        "ціха і цёпла",
        "сто адзін",
        "вельмі ўтульна"
    ],
    "134"
];
Test2_arr[14] = [
    "Адзначце сказы, у якіх выдзеленае  слова (словы) з’яўляюцца азначэннямі",
    [
        "Незвычайнае хараство і зладжанасць чуецца нам у гучанні РОДНАГА слова.",
        "Ветрык ЗАКАХАНЫМ лагодна гладзіць твар.",
        "З лесу выйшаў грыбнік, МОКРЫ АД РАСЫ. ",
        "Прывычка ЧЫТАЦЬ ніколі не пакідала Алеся.",
        ""
    ],
    "134"
];
Test2_arr[15] = [
    "Адзначце сказы з прапушчанымі знакамі прыпынку:",
    [
        "Вясной кожны раз усё іначай пахне і свеціць, і расце.",
        "Усё навокал тое ж, як і ў кожную вясну і адліга, і лужыны, і свежасць сакавіцкіх вятроў.",
        "Абагнуў сяброў ручай, выслізнуў з-пад самых ног, знік, прапаў, зашыўся ў мох.",
        "Замірае, сціхае мая залатая дуброва, асыпае, скідае на дол свой задумлівы ўбор.",
        ""
    ],
    "12"
];
Test2_arr[16] = [
    "Адзначце сказы, у якіх вызначаныя словы (словазлучэнні, сказы) трэба выдзеліць коскамі:",
    [
        "Вялікія, румяныя, адно ў адно яблыкі былі АДНАК кіслыя.",
        "Упускаем у сэрца зіму і НА ЖАЛЬ не можам без зімы.",
        "Больш вольна адчуваў сябе Вадзім МЕНАВІТА ў дарозе.",
        "Слезы ЯДКУЛЬ ЯНЫ ЎЗЯЛІСЯ? нястрымна лінулі з вачэй.",
        ""
    ],
    "12"
];
Test2_arr[17] = [
    "Адзначце сказы, у якіх на месцы пропуску трэба паставіць двукроп’е:",
    [
        "Хлеб у возе_няма бяды ў дарозе. ",
        "Дзве хвіліны_і самалёт знікне ў сіняве.",
        "Ноч гусцее_пагасла_зорка срэбная ўпала ў ваду.",
        "Сэрцу быць гадзіннікам нягожа_спыніцца – ужо не завядзеш.",
        ""
    ],
    "4"
];
Test2_arr[18] = [
    "Адзначце сказы з простай мовай, у якіх знакі прыпынку пастаўлены правільна:",
    [
        "“ Прыехаў, сынок? –  спытала маці  і мякка дадала: – Я цябе даўно чакаю”.",
        "“ Вярніся, неслух!” – пачуў Міколка дзедаў загад.",
        "Заўсёды баішся пачуць у адказ – “Мне, прабачце, цяпер не да вас”.",
        "“ Тут на цябе вельмі сур’ёзная скарга” – гаворыць Агурскі.",
        ""
    ],
    "12"
];
Test2_arr[19] = [
    `Вызначце граматычную аснову безасабовага сказа:
    Чакайце мяне ў госці.
    Учарашняга дня не вернеш.
    Мудрая восеньская цішыня. 
    Неба чыстае.`,
    [
        "мяне",
        "Учарашняга",
        "цішыня",
        "Неба",
        ""    
    ],
    "3"   
];

export default Test2_arr.sort(() => Math.random() - 0.5);
